app/controllers/gallery_controller.rb

  def show
    @user = User.find(:first,:conditions=>['twitter_name = ?', params[:id]])
---
SELECT * FROM `users` WHERE (twitter_name = 'thirtysixthspan') LIMIT 1