app/controllers/passport_controller.rb

SELECT * FROM `users` WHERE (twitter_name = 'thirtysixthspan') LIMIT 1
---
  def show
    @user = User.find(:first,:conditions=>['twitter_name = ?', params[:id]])