app/controllers/vault_controller.rb

  def show
    @user = User.find(:first,:conditions=>['twitter_name = ?', params[:id]])
    redirect_to :controller=>:box, :action=>"load_user" and return if !@user

    @items = @user.items
    @item_types = ItemType.find(:all)
---
SELECT * FROM `users` WHERE (twitter_name = 'thirtysixthspan') LIMIT 1
SELECT * FROM `item_types` WHERE (`item_types`.`id` = 3)